RIOT-OS/RIOT/cpu/efm32/families/efr32zg23/include/vendor/efr32zg23_usart.h
/* Bit fields for USART IRCTRL */
#define _USART_IRCTRL_RESETVALUE                0x00000000UL                            /**< Default value for USART_IRCTRL              */
#define _USART_IRCTRL_MASK                      0x0000008FUL                            /**< Mask for USART_IRCTRL                       */
#define USART_IRCTRL_IREN                       (0x1UL << 0)                            /**< Enable IrDA Module                          */
#define _USART_IRCTRL_IREN_SHIFT                0                                       /**< Shift value for USART_IREN                  */
#define _USART_IRCTRL_IREN_MASK                 0x1UL                                   /**< Bit mask for USART_IREN                     */
#define _USART_IRCTRL_IREN_DEFAULT              0x00000000UL                            /**< Mode DEFAULT for USART_IRCTRL               */
#define USART_IRCTRL_IREN_DEFAULT               (_USART_IRCTRL_IREN_DEFAULT << 0)       /**< Shifted mode DEFAULT for USART_IRCTRL       */
#define _USART_IRCTRL_IRPW_SHIFT                1                                       /**< Shift value for USART_IRPW                  */
#define _USART_IRCTRL_IRPW_MASK                 0x6UL                                   /**< Bit mask for USART_IRPW                     */
#define _USART_IRCTRL_IRPW_DEFAULT              0x00000000UL                            /**< Mode DEFAULT for USART_IRCTRL               */
#define _USART_IRCTRL_IRPW_ONE                  0x00000000UL                            /**< Mode ONE for USART_IRCTRL                   */
#define _USART_IRCTRL_IRPW_TWO                  0x00000001UL                            /**< Mode TWO for USART_IRCTRL                   */
#define _USART_IRCTRL_IRPW_THREE                0x00000002UL                            /**< Mode THREE for USART_IRCTRL                 */
#define _USART_IRCTRL_IRPW_FOUR                 0x00000003UL                            /**< Mode FOUR for USART_IRCTRL                  */
#define USART_IRCTRL_IRPW_DEFAULT               (_USART_IRCTRL_IRPW_DEFAULT << 1)       /**< Shifted mode DEFAULT for USART_IRCTRL       */
#define USART_IRCTRL_IRPW_ONE                   (_USART_IRCTRL_IRPW_ONE << 1)           /**< Shifted mode ONE for USART_IRCTRL           */
#define USART_IRCTRL_IRPW_TWO                   (_USART_IRCTRL_IRPW_TWO << 1)           /**< Shifted mode TWO for USART_IRCTRL           */
#define USART_IRCTRL_IRPW_THREE                 (_USART_IRCTRL_IRPW_THREE << 1)         /**< Shifted mode THREE for USART_IRCTRL         */
#define USART_IRCTRL_IRPW_FOUR                  (_USART_IRCTRL_IRPW_FOUR << 1)          /**< Shifted mode FOUR for USART_IRCTRL          */
#define USART_IRCTRL_IRFILT                     (0x1UL << 3)                            /**< IrDA RX Filter                              */
#define _USART_IRCTRL_IRFILT_SHIFT              3                                       /**< Shift value for USART_IRFILT                */
#define _USART_IRCTRL_IRFILT_MASK               0x8UL                                   /**< Bit mask for USART_IRFILT                   */
#define _USART_IRCTRL_IRFILT_DEFAULT            0x00000000UL                            /**< Mode DEFAULT for USART_IRCTRL               */
#define _USART_IRCTRL_IRFILT_DISABLE            0x00000000UL                            /**< Mode DISABLE for USART_IRCTRL               */
#define _USART_IRCTRL_IRFILT_ENABLE             0x00000001UL                            /**< Mode ENABLE for USART_IRCTRL                */
#define USART_IRCTRL_IRFILT_DEFAULT             (_USART_IRCTRL_IRFILT_DEFAULT << 3)     /**< Shifted mode DEFAULT for USART_IRCTRL       */
#define USART_IRCTRL_IRFILT_DISABLE             (_USART_IRCTRL_IRFILT_DISABLE << 3)     /**< Shifted mode DISABLE for USART_IRCTRL       */
#define USART_IRCTRL_IRFILT_ENABLE              (_USART_IRCTRL_IRFILT_ENABLE << 3)      /**< Shifted mode ENABLE for USART_IRCTRL        */

/* Bit fields for USART I2SCTRL */
#define _USART_I2SCTRL_RESETVALUE               0x00000000UL                            /**< Default value for USART_I2SCTRL             */
#define _USART_I2SCTRL_MASK                     0x0000071FUL                            /**< Mask for USART_I2SCTRL                      */
#define USART_I2SCTRL_EN                        (0x1UL << 0)                            /**< Enable I2S Mode                             */
#define _USART_I2SCTRL_EN_SHIFT                 0                                       /**< Shift value for USART_EN                    */
#define _USART_I2SCTRL_EN_MASK                  0x1UL                                   /**< Bit mask for USART_EN                       */
#define _USART_I2SCTRL_EN_DEFAULT               0x00000000UL                            /**< Mode DEFAULT for USART_I2SCTRL              */
#define USART_I2SCTRL_EN_DEFAULT                (_USART_I2SCTRL_EN_DEFAULT << 0)        /**< Shifted mode DEFAULT for USART_I2SCTRL      */
#define USART_I2SCTRL_MONO                      (0x1UL << 1)                            /**< Stero or Mono                               */
#define _USART_I2SCTRL_MONO_SHIFT               1                                       /**< Shift value for USART_MONO                  */
#define _USART_I2SCTRL_MONO_MASK                0x2UL                                   /**< Bit mask for USART_MONO                     */
#define _USART_I2SCTRL_MONO_DEFAULT             0x00000000UL                            /**< Mode DEFAULT for USART_I2SCTRL              */
#define USART_I2SCTRL_MONO_DEFAULT              (_USART_I2SCTRL_MONO_DEFAULT << 1)      /**< Shifted mode DEFAULT for USART_I2SCTRL      */
#define USART_I2SCTRL_JUSTIFY                   (0x1UL << 2)                            /**< Justification of I2S Data                   */
#define _USART_I2SCTRL_JUSTIFY_SHIFT            2                                       /**< Shift value for USART_JUSTIFY               */
#define _USART_I2SCTRL_JUSTIFY_MASK             0x4UL                                   /**< Bit mask for USART_JUSTIFY                  */
#define _USART_I2SCTRL_JUSTIFY_DEFAULT          0x00000000UL                            /**< Mode DEFAULT for USART_I2SCTRL              */
#define _USART_I2SCTRL_JUSTIFY_LEFT             0x00000000UL                            /**< Mode LEFT for USART_I2SCTRL                 */
#define _USART_I2SCTRL_JUSTIFY_RIGHT            0x00000001UL                            /**< Mode RIGHT for USART_I2SCTRL                */
#define USART_I2SCTRL_JUSTIFY_DEFAULT           (_USART_I2SCTRL_JUSTIFY_DEFAULT << 2)   /**< Shifted mode DEFAULT for USART_I2SCTRL      */
#define USART_I2SCTRL_JUSTIFY_LEFT              (_USART_I2SCTRL_JUSTIFY_LEFT << 2)      /**< Shifted mode LEFT for USART_I2SCTRL         */
#define USART_I2SCTRL_JUSTIFY_RIGHT             (_USART_I2SCTRL_JUSTIFY_RIGHT << 2)     /**< Shifted mode RIGHT for USART_I2SCTRL        */
#define USART_I2SCTRL_DMASPLIT                  (0x1UL << 3)                            /**< Separate DMA Request For Left/Right Data    */
#define _USART_I2SCTRL_DMASPLIT_SHIFT           3                                       /**< Shift value for USART_DMASPLIT              */
#define _USART_I2SCTRL_DMASPLIT_MASK            0x8UL                                   /**< Bit mask for USART_DMASPLIT                 */
#define _USART_I2SCTRL_DMASPLIT_DEFAULT         0x00000000UL                            /**< Mode DEFAULT for USART_I2SCTRL              */
#define USART_I2SCTRL_DMASPLIT_DEFAULT          (_USART_I2SCTRL_DMASPLIT_DEFAULT << 3)  /**< Shifted mode DEFAULT for USART_I2SCTRL      */
#define USART_I2SCTRL_DELAY                     (0x1UL << 4)                            /**< Delay on I2S data                           */
#define _USART_I2SCTRL_DELAY_SHIFT              4                                       /**< Shift value for USART_DELAY                 */
#define _USART_I2SCTRL_DELAY_MASK               0x10UL                                  /**< Bit mask for USART_DELAY                    */
#define _USART_I2SCTRL_DELAY_DEFAULT            0x00000000UL                            /**< Mode DEFAULT for USART_I2SCTRL              */
#define USART_I2SCTRL_DELAY_DEFAULT             (_USART_I2SCTRL_DELAY_DEFAULT << 4)     /**< Shifted mode DEFAULT for USART_I2SCTRL      */
#define _USART_I2SCTRL_FORMAT_SHIFT             8                                       /**< Shift value for USART_FORMAT                */
#define _USART_I2SCTRL_FORMAT_MASK              0x700UL                                 /**< Bit mask for USART_FORMAT                   */
#define _USART_I2SCTRL_FORMAT_DEFAULT           0x00000000UL                            /**< Mode DEFAULT for USART_I2SCTRL              */
#define _USART_I2SCTRL_FORMAT_W32D32            0x00000000UL                            /**< Mode W32D32 for USART_I2SCTRL               */
#define _USART_I2SCTRL_FORMAT_W32D24M           0x00000001UL                            /**< Mode W32D24M for USART_I2SCTRL              */
#define _USART_I2SCTRL_FORMAT_W32D24            0x00000002UL                            /**< Mode W32D24 for USART_I2SCTRL               */
#define _USART_I2SCTRL_FORMAT_W32D16            0x00000003UL                            /**< Mode W32D16 for USART_I2SCTRL               */
#define _USART_I2SCTRL_FORMAT_W32D8             0x00000004UL                            /**< Mode W32D8 for USART_I2SCTRL                */
#define _USART_I2SCTRL_FORMAT_W16D16            0x00000005UL                            /**< Mode W16D16 for USART_I2SCTRL               */
#define _USART_I2SCTRL_FORMAT_W16D8             0x00000006UL                            /**< Mode W16D8 for USART_I2SCTRL                */
#define _USART_I2SCTRL_FORMAT_W8D8              0x00000007UL                            /**< Mode W8D8 for USART_I2SCTRL                 */
#define USART_I2SCTRL_FORMAT_DEFAULT            (_USART_I2SCTRL_FORMAT_DEFAULT << 8)    /**< Shifted mode DEFAULT for USART_I2SCTRL      */
#define USART_I2SCTRL_FORMAT_W32D32             (_USART_I2SCTRL_FORMAT_W32D32 << 8)     /**< Shifted mode W32D32 for USART_I2SCTRL       */
#define USART_I2SCTRL_FORMAT_W32D24M            (_USART_I2SCTRL_FORMAT_W32D24M << 8)    /**< Shifted mode W32D24M for USART_I2SCTRL      */
#define USART_I2SCTRL_FORMAT_W32D24             (_USART_I2SCTRL_FORMAT_W32D24 << 8)     /**< Shifted mode W32D24 for USART_I2SCTRL       */
#define USART_I2SCTRL_FORMAT_W32D16             (_USART_I2SCTRL_FORMAT_W32D16 << 8)     /**< Shifted mode W32D16 for USART_I2SCTRL       */
#define USART_I2SCTRL_FORMAT_W32D8              (_USART_I2SCTRL_FORMAT_W32D8 << 8)      /**< Shifted mode W32D8 for USART_I2SCTRL        */
#define USART_I2SCTRL_FORMAT_W16D16             (_USART_I2SCTRL_FORMAT_W16D16 << 8)     /**< Shifted mode W16D16 for USART_I2SCTRL       */
#define USART_I2SCTRL_FORMAT_W16D8              (_USART_I2SCTRL_FORMAT_W16D8 << 8)      /**< Shifted mode W16D8 for USART_I2SCTRL        */
#define USART_I2SCTRL_FORMAT_W8D8               (_USART_I2SCTRL_FORMAT_W8D8 << 8)       /**< Shifted mode W8D8 for USART_I2SCTRL         */

/* Bit fields for USART TIMING */
#define _USART_TIMING_RESETVALUE                0x00000000UL                            /**< Default value for USART_TIMING              */
#define _USART_TIMING_MASK                      0x77770000UL                            /**< Mask for USART_TIMING                       */
#define _USART_TIMING_TXDELAY_SHIFT             16                                      /**< Shift value for USART_TXDELAY               */
#define _USART_TIMING_TXDELAY_MASK              0x70000UL                               /**< Bit mask for USART_TXDELAY                  */
#define _USART_TIMING_TXDELAY_DEFAULT           0x00000000UL                            /**< Mode DEFAULT for USART_TIMING               */
#define _USART_TIMING_TXDELAY_DISABLE           0x00000000UL                            /**< Mode DISABLE for USART_TIMING               */
#define _USART_TIMING_TXDELAY_ONE               0x00000001UL                            /**< Mode ONE for USART_TIMING                   */
#define _USART_TIMING_TXDELAY_TWO               0x00000002UL                            /**< Mode TWO for USART_TIMING                   */
#define _USART_TIMING_TXDELAY_THREE             0x00000003UL                            /**< Mode THREE for USART_TIMING                 */
#define _USART_TIMING_TXDELAY_SEVEN             0x00000004UL                            /**< Mode SEVEN for USART_TIMING                 */
#define _USART_TIMING_TXDELAY_TCMP0             0x00000005UL                            /**< Mode TCMP0 for USART_TIMING                 */
#define _USART_TIMING_TXDELAY_TCMP1             0x00000006UL                            /**< Mode TCMP1 for USART_TIMING                 */
#define _USART_TIMING_TXDELAY_TCMP2             0x00000007UL                            /**< Mode TCMP2 for USART_TIMING                 */
#define USART_TIMING_TXDELAY_DEFAULT            (_USART_TIMING_TXDELAY_DEFAULT << 16)   /**< Shifted mode DEFAULT for USART_TIMING       */
#define USART_TIMING_TXDELAY_DISABLE            (_USART_TIMING_TXDELAY_DISABLE << 16)   /**< Shifted mode DISABLE for USART_TIMING       */
#define USART_TIMING_TXDELAY_ONE                (_USART_TIMING_TXDELAY_ONE << 16)       /**< Shifted mode ONE for USART_TIMING           */
#define USART_TIMING_TXDELAY_TWO                (_USART_TIMING_TXDELAY_TWO << 16)       /**< Shifted mode TWO for USART_TIMING           */
#define USART_TIMING_TXDELAY_THREE              (_USART_TIMING_TXDELAY_THREE << 16)     /**< Shifted mode THREE for USART_TIMING         */
#define USART_TIMING_TXDELAY_SEVEN              (_USART_TIMING_TXDELAY_SEVEN << 16)     /**< Shifted mode SEVEN for USART_TIMING         */
#define USART_TIMING_TXDELAY_TCMP0              (_USART_TIMING_TXDELAY_TCMP0 << 16)     /**< Shifted mode TCMP0 for USART_TIMING         */
#define USART_TIMING_TXDELAY_TCMP1              (_USART_TIMING_TXDELAY_TCMP1 << 16)     /**< Shifted mode TCMP1 for USART_TIMING         */
#define USART_TIMING_TXDELAY_TCMP2              (_USART_TIMING_TXDELAY_TCMP2 << 16)     /**< Shifted mode TCMP2 for USART_TIMING         */
#define _USART_TIMING_CSSETUP_SHIFT             20                                      /**< Shift value for USART_CSSETUP               */
#define _USART_TIMING_CSSETUP_MASK              0x700000UL                              /**< Bit mask for USART_CSSETUP                  */
#define _USART_TIMING_CSSETUP_DEFAULT           0x00000000UL                            /**< Mode DEFAULT for USART_TIMING               */
#define _USART_TIMING_CSSETUP_ZERO              0x00000000UL                            /**< Mode ZERO for USART_TIMING                  */
#define _USART_TIMING_CSSETUP_ONE               0x00000001UL                            /**< Mode ONE for USART_TIMING                   */
#define _USART_TIMING_CSSETUP_TWO               0x00000002UL                            /**< Mode TWO for USART_TIMING                   */
#define _USART_TIMING_CSSETUP_THREE             0x00000003UL                            /**< Mode THREE for USART_TIMING                 */
#define _USART_TIMING_CSSETUP_SEVEN             0x00000004UL                            /**< Mode SEVEN for USART_TIMING                 */
#define _USART_TIMING_CSSETUP_TCMP0             0x00000005UL                            /**< Mode TCMP0 for USART_TIMING                 */
#define _USART_TIMING_CSSETUP_TCMP1             0x00000006UL                            /**< Mode TCMP1 for USART_TIMING                 */
#define _USART_TIMING_CSSETUP_TCMP2             0x00000007UL                            /**< Mode TCMP2 for USART_TIMING                 */
#define USART_TIMING_CSSETUP_DEFAULT            (_USART_TIMING_CSSETUP_DEFAULT << 20)   /**< Shifted mode DEFAULT for USART_TIMING       */
#define USART_TIMING_CSSETUP_ZERO               (_USART_TIMING_CSSETUP_ZERO << 20)      /**< Shifted mode ZERO for USART_TIMING          */
#define USART_TIMING_CSSETUP_ONE                (_USART_TIMING_CSSETUP_ONE << 20)       /**< Shifted mode ONE for USART_TIMING           */
#define USART_TIMING_CSSETUP_TWO                (_USART_TIMING_CSSETUP_TWO << 20)       /**< Shifted mode TWO for USART_TIMING           */
#define USART_TIMING_CSSETUP_THREE              (_USART_TIMING_CSSETUP_THREE << 20)     /**< Shifted mode THREE for USART_TIMING         */
#define USART_TIMING_CSSETUP_SEVEN              (_USART_TIMING_CSSETUP_SEVEN << 20)     /**< Shifted mode SEVEN for USART_TIMING         */
#define USART_TIMING_CSSETUP_TCMP0              (_USART_TIMING_CSSETUP_TCMP0 << 20)     /**< Shifted mode TCMP0 for USART_TIMING         */
#define USART_TIMING_CSSETUP_TCMP1              (_USART_TIMING_CSSETUP_TCMP1 << 20)     /**< Shifted mode TCMP1 for USART_TIMING         */
#define USART_TIMING_CSSETUP_TCMP2              (_USART_TIMING_CSSETUP_TCMP2 << 20)     /**< Shifted mode TCMP2 for USART_TIMING         */
#define _USART_TIMING_ICS_SHIFT                 24                                      /**< Shift value for USART_ICS                   */
#define _USART_TIMING_ICS_MASK                  0x7000000UL                             /**< Bit mask for USART_ICS                      */
#define _USART_TIMING_ICS_DEFAULT               0x00000000UL                            /**< Mode DEFAULT for USART_TIMING               */
#define _USART_TIMING_ICS_ZERO                  0x00000000UL                            /**< Mode ZERO for USART_TIMING                  */
#define _USART_TIMING_ICS_ONE                   0x00000001UL                            /**< Mode ONE for USART_TIMING                   */
#define _USART_TIMING_ICS_TWO                   0x00000002UL                            /**< Mode TWO for USART_TIMING                   */
#define _USART_TIMING_ICS_THREE                 0x00000003UL                            /**< Mode THREE for USART_TIMING                 */
#define _USART_TIMING_ICS_SEVEN                 0x00000004UL                            /**< Mode SEVEN for USART_TIMING                 */
#define _USART_TIMING_ICS_TCMP0                 0x00000005UL                            /**< Mode TCMP0 for USART_TIMING                 */
#define _USART_TIMING_ICS_TCMP1                 0x00000006UL                            /**< Mode TCMP1 for USART_TIMING                 */
#define _USART_TIMING_ICS_TCMP2                 0x00000007UL                            /**< Mode TCMP2 for USART_TIMING                 */
#define USART_TIMING_ICS_DEFAULT                (_USART_TIMING_ICS_DEFAULT << 24)       /**< Shifted mode DEFAULT for USART_TIMING       */
#define USART_TIMING_ICS_ZERO                   (_USART_TIMING_ICS_ZERO << 24)          /**< Shifted mode ZERO for USART_TIMING          */
#define USART_TIMING_ICS_ONE                    (_USART_TIMING_ICS_ONE << 24)           /**< Shifted mode ONE for USART_TIMING           */
#define USART_TIMING_ICS_TWO                    (_USART_TIMING_ICS_TWO << 24)           /**< Shifted mode TWO for USART_TIMING           */
#define USART_TIMING_ICS_THREE                  (_USART_TIMING_ICS_THREE << 24)         /**< Shifted mode THREE for USART_TIMING         */
#define USART_TIMING_ICS_SEVEN                  (_USART_TIMING_ICS_SEVEN << 24)         /**< Shifted mode SEVEN for USART_TIMING         */
#define USART_TIMING_ICS_TCMP0                  (_USART_TIMING_ICS_TCMP0 << 24)         /**< Shifted mode TCMP0 for USART_TIMING         */
#define USART_TIMING_ICS_TCMP1                  (_USART_TIMING_ICS_TCMP1 << 24)         /**< Shifted mode TCMP1 for USART_TIMING         */
#define USART_TIMING_ICS_TCMP2                  (_USART_TIMING_ICS_TCMP2 << 24)         /**< Shifted mode TCMP2 for USART_TIMING         */
#define _USART_TIMING_CSHOLD_SHIFT              28                                      /**< Shift value for USART_CSHOLD                */
#define _USART_TIMING_CSHOLD_MASK               0x70000000UL                            /**< Bit mask for USART_CSHOLD                   */
#define _USART_TIMING_CSHOLD_DEFAULT            0x00000000UL                            /**< Mode DEFAULT for USART_TIMING               */
#define _USART_TIMING_CSHOLD_ZERO               0x00000000UL                            /**< Mode ZERO for USART_TIMING                  */
#define _USART_TIMING_CSHOLD_ONE                0x00000001UL                            /**< Mode ONE for USART_TIMING                   */
#define _USART_TIMING_CSHOLD_TWO                0x00000002UL                            /**< Mode TWO for USART_TIMING                   */
#define _USART_TIMING_CSHOLD_THREE              0x00000003UL                            /**< Mode THREE for USART_TIMING                 */
#define _USART_TIMING_CSHOLD_SEVEN              0x00000004UL                            /**< Mode SEVEN for USART_TIMING                 */
#define _USART_TIMING_CSHOLD_TCMP0              0x00000005UL                            /**< Mode TCMP0 for USART_TIMING                 */
#define _USART_TIMING_CSHOLD_TCMP1              0x00000006UL                            /**< Mode TCMP1 for USART_TIMING                 */
#define _USART_TIMING_CSHOLD_TCMP2              0x00000007UL                            /**< Mode TCMP2 for USART_TIMING                 */
#define USART_TIMING_CSHOLD_DEFAULT             (_USART_TIMING_CSHOLD_DEFAULT << 28)    /**< Shifted mode DEFAULT for USART_TIMING       */
#define USART_TIMING_CSHOLD_ZERO                (_USART_TIMING_CSHOLD_ZERO << 28)       /**< Shifted mode ZERO for USART_TIMING          */
#define USART_TIMING_CSHOLD_ONE                 (_USART_TIMING_CSHOLD_ONE << 28)        /**< Shifted mode ONE for USART_TIMING           */
#define USART_TIMING_CSHOLD_TWO                 (_USART_TIMING_CSHOLD_TWO << 28)        /**< Shifted mode TWO for USART_TIMING           */
#define USART_TIMING_CSHOLD_THREE               (_USART_TIMING_CSHOLD_THREE << 28)      /**< Shifted mode THREE for USART_TIMING         */
#define USART_TIMING_CSHOLD_SEVEN               (_USART_TIMING_CSHOLD_SEVEN << 28)      /**< Shifted mode SEVEN for USART_TIMING         */
#define USART_TIMING_CSHOLD_TCMP0               (_USART_TIMING_CSHOLD_TCMP0 << 28)      /**< Shifted mode TCMP0 for USART_TIMING         */
#define USART_TIMING_CSHOLD_TCMP1               (_USART_TIMING_CSHOLD_TCMP1 << 28)      /**< Shifted mode TCMP1 for USART_TIMING         */
#define USART_TIMING_CSHOLD_TCMP2               (_USART_TIMING_CSHOLD_TCMP2 << 28)      /**< Shifted mode TCMP2 for USART_TIMING         */

